{"fields":[{"id":"a","label":"faqCategoryName","type":"string"},{"id":"b","label":"faqCategoryCode","type":"string"},{"id":"c","label":"QCode","type":"string"},{"id":"d","label":"Question","type":"string"},{"id":"e","label":"Answer","type":"string"}],"data":[["Baggage","1","1","Should I lock my Baggage?","Yes. In case of the requirements of physical check on doubt, you will be requested to open the baggage yourself."],["Baggage","1","2","How do I transport a Firearm or  Ammunition?","There are specific regulations governing the transport of firearms, firearm parts, and ammunition."],["Baggage","1","3","What If my Baggage is missing at Airport ?","If your bags are delayed, try not to panic. The airlines typically have ways to track them, and the vast majority of misplaced luggage is returned eventually. If your bags are on the next flight, you could have them within a few hours. If they have been sent to the wrong airport, it could take a couple of days. Make sure to file your claim immediately at the airport and to give the attendant a hotel or home address, as well as a phone number where you can be reached."],["License","2","1","Where a person can get information for issue\/conversion of a licence?","The requirements for conversion\/issue of licence are specified in CAR Section 7 Series ‘G’ Part I and schedule-II of the aircraft rules. The requirements for CPL are also clearly spelled out in the application form for issue \/ conversions of CPL."],["License","2","2","Whether NOC is required for endorsement of multi-engine on Indian CPL?","Indian Pilots going abroad for multi-engine endorsement training in an ICAO Contracting State in their own interest are required to get the training syllabus approved by DGCA."],["License","2","3","Whether a licence lapsed can be renewed?","Expired license are renewed under Rule 42 of the Aircraft Rules.  The requirements for renewal of expired licences\/ ratings are laid down in CAR Section 7 Series ‘H’ Part I also."],["License","2","4","Whether FRTOL can be issued without RTR (A) of Ministry of Communication?","No. The requirements for issue of FRTOL are laid down in Section ‘Y’ of the Schedule II of the Aircraft Rules."],["License","2","5","Whether recency of flying to be considered valid in case documents are submitted prior to the same i.e. flying experience of 15 hours as PIC in the preceding six months?","in all respect for issue of license."],["License","2","6","Whether fee will be adjusted in case documents are withdrawn due to some shortfall in papers?","The requirement for fees for issue, renewal and validation of licences and ratings are specified in Rule 48 (1) of the Aircraft Rules.  In case the documents are withdrawn due to some shortfall in the papers, the fee deposited can be adjusted at the time of issue, renewal and validation of licences\/ratings subsequently."],["License","2","7","Whether a Pilot can get endorsement on an aircraft already available in India?","Pilots are granted type endorsement on their Indian licences to fly aircrafts registered in India having valid C of A and C of R."],["License","2","8","Whether a person holding FAA license can do recency flying in India?","A person holding FAA licence can do recency flying in India in any of the Flying Training Institute approved by the DGCA subject to comply with the provisions of Rule 6, Rule 38A, Rule 39B  of the Aircraft Rules, 1937 i.e. the applicant must have a valid Indian Student Pilot Licence, Valid FRTOL and  he medical."],["License","2","9","Whether a person holding FAA licence can do recency flying in Philippines?","No. However, a person can fly a foreign registered aircraft in accordance with the Rules being followed by the Regulatory Authority of the State where the aircraft is operating."],["License","2","10","How to obtain a RTR?","RTR is issued by Central Government through Ministry of Communication under Indian Wireless Telegraphy Rules, 1954. For details please see their website www.dot.gov.in"],["License","2","11","Whether a person can submit the paper without RTR (A) from Ministry of Communication?","then only the application would be processed for issue of license."],["License","2","12","What is the requirement to acquire additional or extension of aircraft rating on Multi-engine?","Pilots holding Indian license are required to seek approval of their flying training syllabus from DGCA for obtaining Multiengine rating."],["License","2","13","How much time is taken by DGCA to process the issue of licence?","for issue of license, the entire documents are returned for necessary compliance and addition 15 days are required for reexamination of the documents form the date of submission of documents in DGCA."],["License","2","14","Whether a person can get Instructor Rating on FAA licence and the same will be converted on Indian CPL?","on FAA licences can be validated as per the requirements laid down in CAR Section 7, Series G, Part II."],["License","2","15","How to renew IR on CPL?","India subject to compliance to the recency requirement as laid down in the operations circular 2 of 2004."],["License","2","16","Is it essential to submit original documents while applying for issue\/ conversion of license?","The list of documents to be submitted for issue \/ conversion of license is given at serial number 21 of the application Performa available on DGCA web site www.dgca.nic.in under the tab forms."],["License","2","17","Whether any permission is required for carrying out instrument rating test outside India on Indian CPL?","of the concerned ICAO contracting state."],["License","2","18","Whether a person can carry out flying on any Multi Engine aircraft on Indian CPL in case only one type of ME is already endorsed on license?","As per the aircraft rules a person cannot exercise the privileges of his CPL on the aircraft which is not endorsed on his CPL."],["License","2","19","Whether a person can continue flying when a pilot is not having valid medical class-I or Class-II?","No person can fly without valid medical."],["Passenger","3","1","What are Permitted and Prohibited Items?","Prohibited items are weapons, explosives, incendiaries, and items that are seemingly harmless but may be used as weapons - the so-called \"dual-use\" items."],["Passenger","3","2","How early should I arrive at the airport?","Check with your airline or travel agent to determine how early to arrive at the airport. Recommended check-in times differ by airline\/airport and change during peak travel times."],["Passenger","3","3","How should I pack before my flight?","There are different restrictions on what you can pack in your carry-on & checked baggages. All of your baggage will be screened and possibly hand-searched as part of the new security measures."],["Passenger","3","4","What can I do if my property is lost, missing or damaged during the baggage screening process or at the Security Checkpoint?","It is our job to assure you - the passenger - that BCAS\/Airlines\/Aviation Security Group can and will deliver excellence in security and customer service."],["Passenger","3","5","What do I need to know if I am a Traveler with a Disability or Medical Condition?","In order to assist persons with disabilities or medical concerns, certain guidelines have been developed with input from various groups and have trained our airport screeners in the methodology needed to ensure secure and comfortable screening at all Security Checkpoints."],["Security","4","1","What should I expect at the Security Checkpoint?","The Passenger Security Checkpoint includes three (3) primary steps."],["Security","4","2","What may happen to me if I bring a prohibited item to a security checkpoint?","If you bring a prohibited item to the checkpoint you may be criminally prosecuted or at the least asked to rid yourself of the item"],["Security","4","3","Can I carry a kirpan in the passenger cabin?","Yes.  If you are a Sikh passenger and traveling in domestic flight in India.   The size of kirpan should not be more than 6 inch blade and 3 inch handle."],["Security","4","4","What is the permissible size of hand baggage allowed for air passengers?","115 cm total of all dimensions except at Srinagar airport where carry-on (hand baggage) is not allowed."],["Special Needs","5","1","If I need a wheelchair, what should I do? Is there a charge?","If a wheelchair is needed, the request should be placed at the time of reservation, ticketing or reconfirmation of the booking. Passengers are requested to pre-book wheelchairs at the time of flight booking \/ ticket issuance to avoid last minute delays \/ non availability of wheelchairs."],["Special Needs","5","2","If I require a stretcher, what are the formalities that require to be completed?","You will be required to prepare and submit a Medical Information form (MEDIF)."],["Special Needs","5","3","If I require oxygen supply on board what are the formalities?","You will be required to prepare and submit a Medical Information form (MEDIF)."],["Special Needs","5","4","Can a wheelchair be made available to me all the way to the aircraft?","Yes. Passengers are requested to pre-book wheelchairs at the time of flight booking \/ ticket issuance to avoid last minute delays \/ non availability of wheelchairs. However, business class passengers should note that if traveling by the B747\/COMBI\/744 aircraft types, ascending\/descending steps will be necessary. Hence, before making your reservation please check the type of aircraft with our reservations center. You should be able to ascend\/descend the steps and walk to\/from your seat."],["Special Needs","5","5","Can I carry my own electrically operated wheelchair with me on board the aircraft?","Yes. However, a medical certificate stating the need to carry and operate your own wheelchair has to be produced."],["Special Needs","5","6","What if I have special medications that I must carry with me?","If you require special medication, you should always carry your prescription with you when you board any flight. Different countries have different laws governing the possession of prescription drugs, and some countries have limited supplies should you require a refill of your prescription, so it is always better to bring an extra supply with you. For further information concerning any particular medications, consult with your physician and contact the local embassy of the country to which you are travelling."],["Special Needs","5","7","Till what stage can a pregnant woman travel without an escort?","An expectant mother in good health may be accepted for transportation up to and including the 32nd week of pregnancy. At the time of making the bookings, if the pregnancy is advanced beyond 32 weeks and with the anticipation of normal delivery, the expectant mother be accepted for travel up to and including the 35th week of pregnancy, i.e., up to, at least 5 weeks prior to the expected date of confinement. A medical certificate from the attending obstetrician must be obtained stating that she is fit to travel."]]}